# 1. SQL Tables

This information contains information on creating, renaming, deleting, copying, etc. tables using SQL. As usual, we connect to our database via,

In [1]:
# Using prettytable to display tables,
import prettytable

# Creating connection,
%load_ext sql
%sql sqlite:///database.db

### 1.1 Creating Tables

A table in RDBMS is a combination of rows and columns. To create a table we use the **CREATE TABLE** command followed by the table name and the details of each field contained within brackets _()_. Each field is given in a list with the details in the format of the field name followed by the data type (**INT**, **FLOAT**, **BLOOLEAN**, **CHAR**, ect.). Let us now create a table to contain customer details,

In [3]:
%%sql
CREATE TABLE Customers (
	FirstName VARCHAR(32),
    LastName VARCHAR(32),
    Age INT,
    Customer_ID CHAR(16) PRIMARY KEY
);

 * sqlite:///database.db
Done.

[]

For the name fields, we have used the **VARCHAR** data type which allows to limit the number of characters in our string (up to 32 in our case). So far, this is the bare-bones code for creating a table and there are the additional considerations below:

- **Field Contraints**: We may set constraints for the field data. For example, we many want some fields to be required. That is, we do not want them to be **NULL** or empty. In this case, we add the *NOT NULL* contraint to the field.  
- **Primary Key Assignment**: It is common to want to use a particular field as an ID so we have a way to identify or keep track of certain rows. For this purpose we assign a field to be the primay key. Primary key fields must contain no duplicates and **NULL** (empty) values.
- **ERROR 1050**: Often a table may or may not exist. To avoid encountering the error code: _ERROR 1050: Table 'table_name' already exists_, we use the command **CREATE TABLE IF NOT EXISTS** with the additional condition.

With this in mind, we have,

In [7]:
%%sql
CREATE TABLE IF NOT EXISTS Customers (
	FirstName VARCHAR(32) NOT NULL,
    LastName VARCHAR(32),
    Age INT,
    Customer_ID CHAR(16) NOT NULL,
    PRIMARY KEY (Customer_ID)
);

 * sqlite:///database.db
Done.

[]

We can verify that we have created the table by using the **PRAGMA** command with the _table_info()_ method. This is specific to SQLite, for example, the **DESC** command in "DESC Customers;" can simply be used in mySQL.

In [5]:
%%sql
PRAGMA table_info(Customers);

 * sqlite:///database.db
Done.

[(0, 'FirstName', 'VARCHAR(32)', 0, None, 0),
 (1, 'LastName', 'VARCHAR(32)', 0, None, 0),
 (2, 'Age', 'INT', 0, None, 0),
 (3, 'Customer_ID', 'CHAR(16)', 0, None, 1)]

### 1.2 Show Tables


There are several instances when you may to need to retrieve a list of tables from your database. This could be done for testing purposes, to identify any existing tables before adding or removing any, or for any other reason. Each database architecture has their own metadata base scheme which stores information about the tables in a database. For **SQLite**, this metadata is store in the master table which is called "sqlite_master". Below, we select all entries from sqlite_master,

In [6]:
%%sql
SELECT * FROM sqlite_master;

 * sqlite:///database.db
Done.

[('table', 'Customers_copy1', 'Customers_copy1', 2, 'CREATE TABLE Customers_copy1(\n  FirstName TEXT,\n  LastName TEXT,\n  Age INT,\n  Customer_ID TEXT\n)'),
 ('table', 'Customers_copy2', 'Customers_copy2', 5, 'CREATE TABLE Customers_copy2(\n  FirstName TEXT,\n  LastName TEXT,\n  Age INT,\n  Customer_ID TEXT\n)'),
 ('table', 'Customers_copy3', 'Customers_copy3', 6, 'CREATE TABLE Customers_copy3 (\n    FirstName VARCHAR(32) NOT NULL,\n    LastName VARCHAR(32),\n    Age INT,\n    Customer_ID CHAR(16) NOT NULL,\n    PRIMARY KEY (Customer_ID)\n)'),
 ('index', 'sqlite_autoindex_Customers_copy3_1', 'Customers_copy3', 7, None),
 ('table', 'old_customer_data', 'old_customer_data', 10, 'CREATE TABLE old_customer_data (\n    ID PRIMARY KEY,\n    FirstName VARCHAR(32) NOT NULL, \n    LastName VARCHAR(32) NOT NULL,\n    Age INT,\n    Sex TEXT CHECK(Sex IN ("male", "female")),\n    Package TEXT CHECK(Package IN ("Basic", "Standard", "Premium")) NOT NULL\n)'),
 ('index', 'sqlite_autoindex_old_customer_data_1', 'old_customer_data', 11, None),
 ('table', 'customer_data', 'customer_data', 8, 'CREATE TABLE customer_data (\n    ID INTEGER PRIMARY KEY AUTOINCREMENT,\n    FirstName VARCHAR(32) NOT NULL,\n    LastName VARCHAR (32) NOT NULL,\n    Age INT,\n    Sex TEXT CHECK(Sex IN ("male", "female")),\n    Package TEXT CHECK(Package IN ("Basic", "Standard", "Premium")) NOT NULL\n)'),
 ('table', 'sqlite_sequence', 'sqlite_sequence', 9, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'customer_data_premium', 'customer_data_premium', 12, 'CREATE TABLE customer_data_premium(\n  ID INT,\n  FirstName TEXT,\n  LastName TEXT,\n  Age INT,\n  Sex TEXT,\n  Package TEXT\n)'),
 ('table', 'purchases', 'purchases', 13, 'CREATE TABLE purchases (\n    TRANS_ID INT NOT NULL,\n    CUSTOMER_ID INT NOT NULL,\n    ProductName VARCHAR(32) NOT NULL,\n    Brand VARCHAR(32),\n    Quantity INT NOT NULL\n)'),
 ('table', 'Customers', 'Customers', 3, 'CREATE TABLE Customers (\n\tFirstName VARCHAR(32),\n    LastName VARCHAR(32),\n    Age INT,\n    Customer_ID CHAR(16) PRIMARY KEY\n)'),
 ('index', 'sqlite_autoindex_Customers_1', 'Customers', 4, None)]

We many also use the same command to display entire tables within our database (our Customers table is empty),

In [7]:
%%sql
SELECT * FROM Customers;

 * sqlite:///database.db
Done.

[]

### 1.3 Deleting Tables

Deleting tables completely in SQL is refered to as dropping. Once a table is dropped, it cannot be recovered (this includes its metadata). To drop a table, we simply use the **DROP TABLE** command followed by the table name.

In [8]:
%%sql
DROP TABLE Customers;

 * sqlite:///database.db
Done.

[]

### 1.4 Renaming Tables

In SQLite, we rename a table by using the **ALTER** and **RENAME TO** commands below. MySQL also allows for the syntax _"RENAME TABLE table_name to new_table_name"_ as well (note that SQLite does not).

In [ ]:
%%sql
ALTER TABLE Customers RENAME TO Buyers;

 * sqlite:///database.db
Done.

[]

Renaming it back,

In [77]:
%%sql
ALTER TABLE Buyers RENAME TO Customers;

 * sqlite:///database.db
Done.

[]

Avoid renaming system tables − System tables are tables that are created and used by the database management system itself. Renaming these tables can cause issues with the functioning of the database system, so it is generally not recommended to rename system tables.

Update all references to the table − After renaming a table, any stored procedures, views, triggers, or other database objects that reference the table will need to be updated to use the new name of the table. Failure to update these references can result in errors or issues with the functioning of the database system.

Test thoroughly − Before renaming a table in a production environment, it is important to test the renaming process thoroughly in a development or testing environment to ensure that all references to the table have been updated correctly and that the database system continues to function as expected.

Use a consistent naming convention − It is a good practice to use a consistent naming convention for tables and other database objects to make it easier to understand and maintain the database system. If you need to rename a table, consider following the same naming convention that you have used for other tables in the database.

Backup the database − Before renaming a table, it is recommended to create a backup of the database to ensure that you have a restore point; in case anything goes wrong during the renaming process.

### 1.5 Deleting Rows

To delete a row in table, we use the **DELETE** command paired with **WHERE**. If we do not provide a condition with **WHERE**, all rows in the table will be deleted. To demonstate this, let us populate our table,

In [14]:
%%sql
INSERT INTO Customers (FirstName, LastName, Age, Customer_ID) VALUES
('Alice', 'Johnson', 29, 'CUST000000000001'),
('Bob', 'Smith', 42, 'CUST000000000002'),
('Charlie', 'Lee', 35, 'CUST000000000003'),
('Diana', 'Martinez', 27, 'CUST000000000004'),
('Ethan', 'Brown', 50, 'CUST000000000005'),
('Fiona', 'Davis', 31, 'CUST000000000006'),
('George', 'Wilson', 44, 'CUST000000000007'),
('Hannah', 'Taylor', 23, 'CUST000000000008'),
('Ian', 'Anderson', 38, 'CUST000000000009'),
('Jasmine', 'Thomas', 26, 'CUST000000000010'),
('Kevin', 'Moore', 41, 'CUST000000000011'),
('Laura', 'White', 33, 'CUST000000000012'),
('Michael', 'Hall', 47, 'CUST000000000013'),
('Nina', 'Allen', 28, 'CUST000000000014'),
('Oscar', 'Young', 36, 'CUST000000000015'),
('Priya', 'King', 32, 'CUST000000000016'),
('Quentin', 'Wright', 45, 'CUST000000000017'),
('Rita', 'Scott', 25, 'CUST000000000018'),
('Samuel', 'Green', 39, 'CUST000000000019'),
('Tina', 'Baker', 30, 'CUST000000000020');

SELECT * FROM Customers

 * sqlite:///database.db
20 rows affected.
Done.

[('Alice', 'Johnson', 29, 'CUST000000000001'),
 ('Bob', 'Smith', 42, 'CUST000000000002'),
 ('Charlie', 'Lee', 35, 'CUST000000000003'),
 ('Diana', 'Martinez', 27, 'CUST000000000004'),
 ('Ethan', 'Brown', 50, 'CUST000000000005'),
 ('Fiona', 'Davis', 31, 'CUST000000000006'),
 ('George', 'Wilson', 44, 'CUST000000000007'),
 ('Hannah', 'Taylor', 23, 'CUST000000000008'),
 ('Ian', 'Anderson', 38, 'CUST000000000009'),
 ('Jasmine', 'Thomas', 26, 'CUST000000000010'),
 ('Kevin', 'Moore', 41, 'CUST000000000011'),
 ('Laura', 'White', 33, 'CUST000000000012'),
 ('Michael', 'Hall', 47, 'CUST000000000013'),
 ('Nina', 'Allen', 28, 'CUST000000000014'),
 ('Oscar', 'Young', 36, 'CUST000000000015'),
 ('Priya', 'King', 32, 'CUST000000000016'),
 ('Quentin', 'Wright', 45, 'CUST000000000017'),
 ('Rita', 'Scott', 25, 'CUST000000000018'),
 ('Samuel', 'Green', 39, 'CUST000000000019'),
 ('Tina', 'Baker', 30, 'CUST000000000020')]

Now we delete any customers who are over the age of 40. That is, we delete any rows whose age field contains a value above 40 with the following command,

In [9]:
%%sql

DELETE FROM Customers WHERE Age > 40;
SELECT * FROM Customers;

 * sqlite:///database.db
6 rows affected.
Done.

[('Alice', 'Johnson', 29, 'CUST000000000001'),
 ('Charlie', 'Lee', 35, 'CUST000000000003'),
 ('Diana', 'Martinez', 27, 'CUST000000000004'),
 ('Fiona', 'Davis', 31, 'CUST000000000006'),
 ('Hannah', 'Taylor', 23, 'CUST000000000008'),
 ('Ian', 'Anderson', 38, 'CUST000000000009'),
 ('Jasmine', 'Thomas', 26, 'CUST000000000010'),
 ('Laura', 'White', 33, 'CUST000000000012'),
 ('Nina', 'Allen', 28, 'CUST000000000014'),
 ('Oscar', 'Young', 36, 'CUST000000000015'),
 ('Priya', 'King', 32, 'CUST000000000016'),
 ('Rita', 'Scott', 25, 'CUST000000000018'),
 ('Samuel', 'Green', 39, 'CUST000000000019'),
 ('Tina', 'Baker', 30, 'CUST000000000020')]

We can also chain together multiple conditions with **AND** and **OR** together,

In [11]:
%%sql

DELETE FROM Customers WHERE Age > 35 OR Age < 25;
SELECT * FROM Customers;

 * sqlite:///database.db
4 rows affected.
Done.

[('Alice', 'Johnson', 29, 'CUST000000000001'),
 ('Charlie', 'Lee', 35, 'CUST000000000003'),
 ('Diana', 'Martinez', 27, 'CUST000000000004'),
 ('Fiona', 'Davis', 31, 'CUST000000000006'),
 ('Jasmine', 'Thomas', 26, 'CUST000000000010'),
 ('Laura', 'White', 33, 'CUST000000000012'),
 ('Nina', 'Allen', 28, 'CUST000000000014'),
 ('Priya', 'King', 32, 'CUST000000000016'),
 ('Rita', 'Scott', 25, 'CUST000000000018'),
 ('Tina', 'Baker', 30, 'CUST000000000020')]

Not that we can remove all the rows from the table, effectively resetting the table to its original state (containing only the structure and its constraints). However, it's important to note that this cannot be undone, and all the data in the table will be permanently deleted.

In [13]:
%%sql

DELETE FROM Customers;
SELECT * FROM Customers;

 * sqlite:///database.db
10 rows affected.
Done.

[]

It should be pointed out that **DELETE** is a DML command which inspects each row at a time and check if it meets the deletion condition. This holds even when no conditions are given. Using **DELETE** for large tables containing millions of rows can be slow. Therefore, it is good practice to instead use **TRUNCATE TABLE** which allows us to delete all rows in the table while keeping its structure. Note that SQLite does not support this command as it is not designed to handle very large databases.

### 1.6 Cloning Tables

There are many situations where we may need an exact copy of a table to modify seperately. Three types of cloning: **simple**, **shallow** and **deep** exist in various RDBMS. In simple cloning, we create a table and simply copy all the rows from the other table we are copying from (note that in MySQL we do not include **AS**),

In [ ]:
%%sql
CREATE TABLE Customers_copy1 AS SELECT * FROM Customers;
SELECT * FROM Customers_copy1;

 * sqlite:///database.db
Done.
Done.

[('Alice', 'Johnson', 29, 'CUST000000000001'),
 ('Bob', 'Smith', 42, 'CUST000000000002'),
 ('Charlie', 'Lee', 35, 'CUST000000000003'),
 ('Diana', 'Martinez', 27, 'CUST000000000004'),
 ('Ethan', 'Brown', 50, 'CUST000000000005'),
 ('Fiona', 'Davis', 31, 'CUST000000000006'),
 ('George', 'Wilson', 44, 'CUST000000000007'),
 ('Hannah', 'Taylor', 23, 'CUST000000000008'),
 ('Ian', 'Anderson', 38, 'CUST000000000009'),
 ('Jasmine', 'Thomas', 26, 'CUST000000000010'),
 ('Kevin', 'Moore', 41, 'CUST000000000011'),
 ('Laura', 'White', 33, 'CUST000000000012'),
 ('Michael', 'Hall', 47, 'CUST000000000013'),
 ('Nina', 'Allen', 28, 'CUST000000000014'),
 ('Oscar', 'Young', 36, 'CUST000000000015'),
 ('Priya', 'King', 32, 'CUST000000000016'),
 ('Quentin', 'Wright', 45, 'CUST000000000017'),
 ('Rita', 'Scott', 25, 'CUST000000000018'),
 ('Samuel', 'Green', 39, 'CUST000000000019'),
 ('Tina', 'Baker', 30, 'CUST000000000020')]

In shallow cloning, we all copy the table structure and not any of its data. In SQLite, we have,

In [32]:
%%sql
CREATE TABLE Customers_copy2 AS SELECT * FROM Customers WHERE 0;
SELECT * FROM Customers_copy2;

 * sqlite:///database.db
Done.
Done.

[]

In SQLite, shallow and deep copying do not exist like they do in MySQL. We able to shallow copy by analogy as shown above, but we cannot deep copy which involves copying the contraints and keys. For deep copying, we have to manually replicate the schema of the table we are copying from and then copy its data.

In [40]:
%%sql
CREATE TABLE Customers_copy3 (
    FirstName VARCHAR(32) NOT NULL,
    LastName VARCHAR(32),
    Age INT,
    Customer_ID CHAR(16) NOT NULL,
    PRIMARY KEY (Customer_ID)
);

INSERT INTO Customers_copy3 SELECT * FROM Customers;
SELECT * FROM Customers;

 * sqlite:///database.db
Done.
20 rows affected.
Done.

[('Alice', 'Johnson', 29, 'CUST000000000001'),
 ('Bob', 'Smith', 42, 'CUST000000000002'),
 ('Charlie', 'Lee', 35, 'CUST000000000003'),
 ('Diana', 'Martinez', 27, 'CUST000000000004'),
 ('Ethan', 'Brown', 50, 'CUST000000000005'),
 ('Fiona', 'Davis', 31, 'CUST000000000006'),
 ('George', 'Wilson', 44, 'CUST000000000007'),
 ('Hannah', 'Taylor', 23, 'CUST000000000008'),
 ('Ian', 'Anderson', 38, 'CUST000000000009'),
 ('Jasmine', 'Thomas', 26, 'CUST000000000010'),
 ('Kevin', 'Moore', 41, 'CUST000000000011'),
 ('Laura', 'White', 33, 'CUST000000000012'),
 ('Michael', 'Hall', 47, 'CUST000000000013'),
 ('Nina', 'Allen', 28, 'CUST000000000014'),
 ('Oscar', 'Young', 36, 'CUST000000000015'),
 ('Priya', 'King', 32, 'CUST000000000016'),
 ('Quentin', 'Wright', 45, 'CUST000000000017'),
 ('Rita', 'Scott', 25, 'CUST000000000018'),
 ('Samuel', 'Green', 39, 'CUST000000000019'),
 ('Tina', 'Baker', 30, 'CUST000000000020')]

### 1.7 Temporary Tables